# Taps
tap 'homebrew/cask'
#tap 'homebrew/cask-eid' deprecated
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'awsebcli'
brew 'bash'
brew 'bat' # "cat" on steroids
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'pkg-config'
brew 'tree'
brew 'java'


# Development
#brew 'php'
#brew 'php@7.4'
#brew 'composer'
#brew 'mysql'
#brew 'node'
#brew 'yarn'

# Apps
#cask 'rectangle'
cask 'iterm2'
#cask 'caffeine'
cask 'firefox'
#cask 'google-chrome'
#cask 'insomnia'
cask 'phpstorm'
cask 'slack'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'tableplus'
#cask 'sequel-pro'
cask 'there'
cask 'the-unarchiver'
cask 'appcleaner'
cask 'tor-browser'
#cask 'vagrant'
cask 'vlc'
#cask 'whatsapp'
#cask 'macdown'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-fantasque-sans-mono'
